In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_excel("D:\\Downloads\\se-3_19_20.xlsx")
df

    Roll No     Name of the Students
0      2301   ABHIJEET SHIVAJI LIMAN
1      2302  ADLINGE AKSHAY HANUMANT
2      2303    AWASARE ROHAN KRISHNA
3      2304    BACHAL SHUBHAM VISHAL
4      2305        BAGUL AKASH JAGAN
..      ...                      ...
72     2373  WANKHADE ABHIJIT KISHOR
73     2374     YADAV MAYUR RAMSAGAR
74     2375       PATIL VISHAL GULAB
75     2376      GHUGE ONKAR SHIVAJI
76     2377      PAWAR SHYAM SHIVAJI

[77 rows x 2 columns]

In [3]:
df = df.set_index('Roll No')

In [5]:
df['Name of the Students'] = [i.title() for i in df['Name of the Students']]

In [6]:
df.head()

            Name of the Students
Roll No
2301      Abhijeet Shivaji Liman
2302     Adlinge Akshay Hanumant
2303       Awasare Rohan Krishna
2304       Bachal Shubham Vishal
2305           Bagul Akash Jagan

In [7]:
df.to_csv("SE-3.csv")